# 004. Условные конструкции

## Для чего нужны условия

Условные конструкции позволяют программе выбирать разное поведение в зависимости от данных.

## `if`

```java
if (age >= 18) {
    System.out.println("Доступ разрешен");
}
```

## `if-else`

```java
if (temperature > 0) {
    System.out.println("Плюс");
} else {
    System.out.println("Ноль или минус");
}
```

## `else if`

```java
if (score >= 90) {
    grade = "A";
} else if (score >= 75) {
    grade = "B";
} else {
    grade = "C";
}
```

## Тернарный оператор

```java
String result = age >= 18 ? "adult" : "minor";
```

Подходит для коротких выражений, но не для сложной логики.

## `switch`

```java
switch (day) {
    case 1 -> System.out.println("Monday");
    case 2 -> System.out.println("Tuesday");
    default -> System.out.println("Unknown");
}
```

## Техническая часть

- условие в `if` должно быть типа `boolean`
- глубокая вложенность ухудшает читаемость
- `switch` удобен для фиксированных значений, а не для диапазонов

## Типичные ошибки

- писать `if (number)` как в других языках
- злоупотреблять вложенными тернарными операторами
- забывать про `default`

## Практика

1. Напишите программу, которая определяет знак числа.
2. Сделайте выбор дня недели через `switch`.
3. Перепишите короткий `if-else` в тернарный оператор.
